<?php

$a = trim(fgets(STDIN));

// <>>><<><<<<<>>><
// 0<3>2>1>0<1<2>0<1<2<3<4<5>2>1>0<1

$count = strlen($a);
$arr = [];
$j = 1;
for ($i = 0; $i < $count - 1; $i++) {
    if ($a[$i] === $a[$i + 1]) {
        $j++;

    } else {
        $arr[][$a[$i]] = $j;
        $j = 1;
    }
}

var_dump($arr);
var_dump($j);

//array(6) {
//    [0]=> array(1) {["<"]=> int(1)}
//    [1]=> array(1) {[">"]=> int(3)} デクリメント
//    [2]=> array(1) {["<"]=> int(2)} インクリメント
//    [3]=> array(1) {[">"]=> int(1)} 1なので、次に0がくる
//    [4]=> array(1) {["<"]=> int(5)} インクリメント
//    [5]=> array(1) {[">"]=> int(3)} デクリメント
//}
//int(1)

if ($j !== 0) {
    // 計算する
}

$arr_count = count($arr);
$ans = 0;
for ($i = 0; $i < $arr_count; $i++) {
    $n = isset($arr[$i]['<']) ? $arr[$i]['<'] : $arr[$i]['>'];
    $ans += array_sum(range(0, $n));
}
echo $ans;

// →
// 0<1> > >0<_<2>0<_<_<_<_<5> > >0<1
// (1-1)+2+5+1(最後の1は$jに格納)
// ←
// 0<3>_>_>0< <1>0< < < < <3>_>_>0<n
// 3+(1-1)+(3-1)+未定
// 合成
// 0<3>_>_>0<_<2>0<_<_<_<_<5>_>_>0<1

// 0<3>2>1>0<1<2>0<1<2<3<4<5>2>1>0<1
// <>>><<><<<<<>>><
// 03210120123452101

// <<<>><<>
// 0<1<2<3>1>0<1<2>0
// 0<_<_<3> >0<_<2>0
// 3 + 2
// 0< < <2>_>0< <1>0
// (2-1)
// 10

// >>><<><<<><>>
// n> > >0<_<2>0<_<_<3>0<1> >0
// n + 2 + 3 + (1-1)
// 3>_>_>0< <1>0< < <1>0<2>_>0
// 3 + (1-1)+ (1-1) + 2

// 3>2>1>0<1<2>0<1<2<3>0<2>1>0
// 17

// <<<<<
// 0<1<2<3<4<5

// >>>>>
// 5>4>3>2>1>0

// <

// >

var_dump($arr);
var_dump($j);


$a = trim(fgets(STDIN));
$count = strlen($a);
$arr = [];
$j = 1;
for ($i = 0; $i < $count - 1; $i++) {
    if ($a[$i] === $a[$i + 1]) {
        $j++;

    } else {
        $arr[] = $j;
        $j = 1;
    }
}

$arr_count = count($arr);
$ans = 0;
for ($i = 0; $i < $arr_count - 1; $i += 2) {
    if ($arr[$i] < $arr[$i + 1]) {
        $ans += array_sum(range(0, $arr[$i] - 1));
        $ans += array_sum(range(0, $arr[$i + 1]));
    } else {
        $ans += array_sum(range(0, $arr[$i]));
        $ans += array_sum(range(0, $arr[$i + 1] - 1));
    }
}

if ($arr_count % 2 === 1) {
    $ans += array_pop($arr);
}

echo $ans + $j;

// <<<<>
// 0<1<2<3<4>0
// ><><><
// 1>0<1>0<1>0<1
// 4

// 0<2>1>0

// ><<
// 4
// >><
// 4
// <>>
// 3 できてない
// <<>
// 3
// <>>><<><<<<<>>><
// 28
// <<<>><<>
// 10
// >>><<><<<><>>
// 17
// <<<<<
// 15
// >>>>>
// 15
// <
// 1
// >
// 1
// <<<<>
// 10
// ><><><
//  >0<1>0<1>0<1
// 1>0<1>0<1>0<

// 1>0<1>0<1>0<1
// 4

// <>>><<><<<<<>>><
// 28

$count = strlen($a);
$ans = [];
$j = 0;
for ($i = 0; $i < $count; $i++) {
    if ($a[$i] === '<') {
        $ans[$i] = $j;
        $j += 1;
    } else {
        $ans[$i] = 1;
        $j = 1;
    }
}

for ($i = $count; $count < $i; $i--) {
    if ($a[$i] === '>') {
        $ans[$i] = max($j, $ans[$i]);
        $j += 1;
    } else {
//        $ans[$i] = 1;
        $j = 1;
    }
}

var_dump($ans);


$arr = str_split($a);
$count = count($arr);
$ans = array_fill(0, $count + 1, 0);

foreach ($arr as $k => $v) {
    if ($v === '<') {
        $ans[$k + 1] = $j;
        $j += 1;
    } else {
        $j = 1;
    }
}

var_dump($ans);

$j = 1;
foreach (array_reverse($arr) as $k => $v) {
    if ($v === '>') {
        $ans[$k] = max($ans[$k], $j);
        $j += 1;
    } else {
        $j = 1;
    }
}
var_dump($ans);
echo array_sum($ans);